; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v5 ?v12)
             (pred_9 ?v2 ?v7)
             (pred_4 ?v5 ?v7)
             (pred_7 ?v4 ?v5 )
	     (pred_5 ?v5)
             (pred_10 ?v3)
             (pred_11 ?v2)
             (pred_8 ?v7)
             (pred_12 ?v5)
             (pred_2 ?v2)
             (pred_6 ?v5)
             (pred_3 ))



(:action op_1
:parameters (?v6 ?v13 ?v9 ?v10)
:precondition (and (pred_10 ?v6) (pred_10 ?v13) (pred_11 ?v9) (pred_8 ?v10)
          (pred_1 ?v6 ?v13) (pred_9 ?v9 ?v10)
                   (pred_4 ?v13 ?v10) (pred_5 ?v6) 
                   (pred_12 ?v13) (pred_2 ?v9))
:effect (and  (pred_6 ?v13) (not (pred_12 ?v13))))


(:action op_3
:parameters (?v6 ?v11)
:precondition (and (pred_10 ?v6) (pred_10 ?v11)
               (pred_5 ?v6) (pred_1 ?v6 ?v11) (pred_6 ?v11))
:effect (and (pred_5 ?v11) (not (pred_5 ?v6))))

(:action op_4
:parameters (?v6 ?v9)
:precondition (and (pred_10 ?v6) (pred_11 ?v9) 
                  (pred_5 ?v6) (pred_7 ?v9 ?v6) (pred_3 ))
:effect (and (pred_2 ?v9)
   (not (pred_7 ?v9 ?v6)) (not (pred_3 ))))


(:action op_5
:parameters (?v6 ?v8 ?v1)
:precondition (and (pred_10 ?v6) (pred_11 ?v8) (pred_11 ?v1)
                  (pred_5 ?v6) (pred_2 ?v1) (pred_7 ?v8 ?v6))
:effect (and (pred_2 ?v8) (pred_7 ?v1 ?v6)
        (not (pred_2 ?v1)) (not (pred_7 ?v8 ?v6))))

(:action op_2
:parameters (?v6 ?v9)
:precondition (and (pred_10 ?v6) (pred_11 ?v9) 
                  (pred_5 ?v6) (pred_2 ?v9))
:effect (and (pred_3 ) (pred_7 ?v9 ?v6) (not (pred_2 ?v9)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_27 obj_28 obj_23 obj_03 obj_13 obj_21 obj_19 obj_16 obj_01 obj_10 obj_30 obj_14 obj_22 obj_08 obj_29 obj_26 obj_17 obj_07 obj_24 obj_15 obj_04 obj_20 obj_06 obj_12 obj_18
    obj_25 obj_11
    obj_02 obj_05 obj_09
    )

    (:init
       (pred_3)

       (pred_10 obj_27)
       (pred_10 obj_28)
       (pred_10 obj_23)
       (pred_10 obj_03)
       (pred_10 obj_13)
       (pred_10 obj_21)
       (pred_10 obj_19)
       (pred_10 obj_16)
       (pred_10 obj_01)
       (pred_10 obj_10)
       (pred_10 obj_30)
       (pred_10 obj_14)
       (pred_10 obj_22)
       (pred_10 obj_08)
       (pred_10 obj_29)
       (pred_10 obj_26)
       (pred_10 obj_17)
       (pred_10 obj_07)
       (pred_10 obj_24)
       (pred_10 obj_15)
       (pred_10 obj_04)
       (pred_10 obj_20)
       (pred_10 obj_06)
       (pred_10 obj_12)
       (pred_10 obj_18)
       (pred_8 obj_25)
       (pred_8 obj_11)
       (pred_11 obj_02)
       (pred_11 obj_05)
       (pred_11 obj_09)

       (pred_1 obj_27 obj_21)
       (pred_1 obj_27 obj_28)
       (pred_1 obj_28 obj_19)
       (pred_1 obj_28 obj_23)
       (pred_1 obj_28 obj_27)
       (pred_1 obj_23 obj_16)
       (pred_1 obj_23 obj_03)
       (pred_1 obj_23 obj_28)
       (pred_1 obj_03 obj_01)
       (pred_1 obj_03 obj_13)
       (pred_1 obj_03 obj_23)
       (pred_1 obj_13 obj_10)
       (pred_1 obj_13 obj_03)
       (pred_1 obj_21 obj_30)
       (pred_1 obj_21 obj_19)
       (pred_1 obj_21 obj_27)
       (pred_1 obj_19 obj_14)
       (pred_1 obj_19 obj_16)
       (pred_1 obj_19 obj_28)
       (pred_1 obj_19 obj_21)
       (pred_1 obj_16 obj_22)
       (pred_1 obj_16 obj_01)
       (pred_1 obj_16 obj_23)
       (pred_1 obj_16 obj_19)
       (pred_1 obj_01 obj_08)
       (pred_1 obj_01 obj_10)
       (pred_1 obj_01 obj_03)
       (pred_1 obj_01 obj_16)
       (pred_1 obj_10 obj_29)
       (pred_1 obj_10 obj_13)
       (pred_1 obj_10 obj_01)
       (pred_1 obj_30 obj_26)
       (pred_1 obj_30 obj_14)
       (pred_1 obj_30 obj_21)
       (pred_1 obj_14 obj_17)
       (pred_1 obj_14 obj_22)
       (pred_1 obj_14 obj_19)
       (pred_1 obj_14 obj_30)
       (pred_1 obj_22 obj_07)
       (pred_1 obj_22 obj_08)
       (pred_1 obj_22 obj_16)
       (pred_1 obj_22 obj_14)
       (pred_1 obj_08 obj_24)
       (pred_1 obj_08 obj_29)
       (pred_1 obj_08 obj_01)
       (pred_1 obj_08 obj_22)
       (pred_1 obj_29 obj_15)
       (pred_1 obj_29 obj_10)
       (pred_1 obj_29 obj_08)
       (pred_1 obj_26 obj_04)
       (pred_1 obj_26 obj_17)
       (pred_1 obj_26 obj_30)
       (pred_1 obj_17 obj_20)
       (pred_1 obj_17 obj_07)
       (pred_1 obj_17 obj_14)
       (pred_1 obj_17 obj_26)
       (pred_1 obj_07 obj_06)
       (pred_1 obj_07 obj_24)
       (pred_1 obj_07 obj_22)
       (pred_1 obj_07 obj_17)
       (pred_1 obj_24 obj_12)
       (pred_1 obj_24 obj_15)
       (pred_1 obj_24 obj_08)
       (pred_1 obj_24 obj_07)
       (pred_1 obj_15 obj_18)
       (pred_1 obj_15 obj_29)
       (pred_1 obj_15 obj_24)
       (pred_1 obj_04 obj_20)
       (pred_1 obj_04 obj_26)
       (pred_1 obj_20 obj_06)
       (pred_1 obj_20 obj_17)
       (pred_1 obj_20 obj_04)
       (pred_1 obj_06 obj_12)
       (pred_1 obj_06 obj_07)
       (pred_1 obj_06 obj_20)
       (pred_1 obj_12 obj_18)
       (pred_1 obj_12 obj_24)
       (pred_1 obj_12 obj_06)
       (pred_1 obj_18 obj_15)
       (pred_1 obj_18 obj_12)
       (pred_12 obj_07)
       (pred_12 obj_27)
       (pred_12 obj_26)
       (pred_4  obj_07 obj_25)
       (pred_4  obj_27 obj_11)
       (pred_4  obj_26 obj_11)
       (pred_6 obj_28)
       (pred_6 obj_23)
       (pred_6 obj_03)
       (pred_6 obj_13)
       (pred_6 obj_21)
       (pred_6 obj_19)
       (pred_6 obj_16)
       (pred_6 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_30)
       (pred_6 obj_14)
       (pred_6 obj_22)
       (pred_6 obj_08)
       (pred_6 obj_29)
       (pred_6 obj_17)
       (pred_6 obj_24)
       (pred_6 obj_15)
       (pred_6 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_06)
       (pred_6 obj_12)
       (pred_6 obj_18)

       (pred_9  obj_02 obj_25)
       (pred_9  obj_05 obj_11)
       (pred_9  obj_09 obj_25)
       (pred_7 obj_02 obj_29)
       (pred_7 obj_05 obj_13)
       (pred_7 obj_09 obj_24)
       (pred_5 obj_14)
    )

    (:goal (and
       (pred_7 obj_02 obj_12)
       (pred_7 obj_05 obj_28)
       (pred_7 obj_09 obj_21)
    ))
(:constraints
  (always (not (pred_5 obj_23)))
)
)

; plan
1. (op_3 obj_14 obj_22)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_22)
   goals met: 0 of 3
2. (op_3 obj_22 obj_08)
   deleted: (pred_5 obj_22)
   added: (pred_5 obj_08)
   goals met: 0 of 3
3. (op_3 obj_08 obj_29)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_29)
   goals met: 0 of 3
4. (op_4 obj_29 obj_02)
   deleted: (pred_7 obj_02 obj_29) (pred_3)
   added: (pred_2 obj_02)
   goals met: 0 of 3
5. (op_3 obj_29 obj_08)
   deleted: (pred_5 obj_29)
   added: (pred_5 obj_08)
   goals met: 0 of 3
6. (op_3 obj_08 obj_24)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_24)
   goals met: 0 of 3
7. (op_3 obj_24 obj_12)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_12)
   goals met: 0 of 3
8. (op_2 obj_12 obj_02)
   deleted: (pred_2 obj_02)
   added: (pred_3) (pred_7 obj_02 obj_12)
   goals met: 1 of 3
9. (op_3 obj_12 obj_24)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_24)
   goals met: 1 of 3
10. (op_4 obj_24 obj_09)
   deleted: (pred_7 obj_09 obj_24) (pred_3)
   added: (pred_2 obj_09)
   goals met: 1 of 3
11. (op_3 obj_24 obj_08)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_08)
   goals met: 1 of 3
12. (op_3 obj_08 obj_01)
   deleted: (pred_5 obj_08)
   added: (pred_5 obj_01)
   goals met: 1 of 3
13. (op_3 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 1 of 3
14. (op_2 obj_03 obj_09)
   deleted: (pred_2 obj_09)
   added: (pred_3) (pred_7 obj_09 obj_03)
   goals met: 1 of 3
15. (op_3 obj_03 obj_13)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_13)
   goals met: 1 of 3
16. (op_4 obj_13 obj_05)
   deleted: (pred_7 obj_05 obj_13) (pred_3)
   added: (pred_2 obj_05)
   goals met: 1 of 3
17. (op_3 obj_13 obj_03)
   deleted: (pred_5 obj_13)
   added: (pred_5 obj_03)
   goals met: 1 of 3
18. (op_3 obj_03 obj_01)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_01)
   goals met: 1 of 3
19. (op_3 obj_01 obj_16)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_16)
   goals met: 1 of 3
20. (op_3 obj_16 obj_19)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_19)
   goals met: 1 of 3
21. (op_3 obj_19 obj_28)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_28)
   goals met: 1 of 3
22. (op_2 obj_28 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_3) (pred_7 obj_05 obj_28)
   goals met: 2 of 3
23. (op_3 obj_28 obj_19)
   deleted: (pred_5 obj_28)
   added: (pred_5 obj_19)
   goals met: 2 of 3
24. (op_3 obj_19 obj_16)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_16)
   goals met: 2 of 3
25. (op_3 obj_16 obj_01)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_01)
   goals met: 2 of 3
26. (op_3 obj_01 obj_03)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_03)
   goals met: 2 of 3
27. (op_4 obj_03 obj_09)
   deleted: (pred_7 obj_09 obj_03) (pred_3)
   added: (pred_2 obj_09)
   goals met: 2 of 3
28. (op_3 obj_03 obj_01)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_01)
   goals met: 2 of 3
29. (op_3 obj_01 obj_16)
   deleted: (pred_5 obj_01)
   added: (pred_5 obj_16)
   goals met: 2 of 3
30. (op_3 obj_16 obj_19)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_19)
   goals met: 2 of 3
31. (op_3 obj_19 obj_21)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_21)
   goals met: 2 of 3
32. (op_2 obj_21 obj_09)
   deleted: (pred_2 obj_09)
   added: (pred_3) (pred_7 obj_09 obj_21)
   goals met: 3 of 3
